of222/tutorials/rheoEFoam/channelEDF/PowerLaw/DebyeHuckel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       299;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    walls
    {
        type            wall;
        nFaces          1;
        startFace       599;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1;
        startFace       600;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       601;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          600;
        startFace       901;
    }
)

// ************************************************************************* //
